Tekla.Structures.Dialog.UIControls.ProfileSelectionForm
The ProfileSelectionForm class represents a dialog to select profiles
using the profile catalogs.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.LibraryProfileItem},System.Collections.Generic.List{Tekla.Structures.Catalogs.ParametricProfileItem})
Creates a new instance of the ProfileSelectionForm.
LibraryProfiles: The library profiles to be added to the dialog.
ParametricProfiles: The parametric profiles to be added to the dialog.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.LibraryProfileItem},System.Collections.Generic.List{Tekla.Structures.Catalogs.ParametricProfileItem},System.String)
Creates a new instance of the ProfileSelectionForm selecting the given profile in the tree control.
LibraryProfileItems: The library profiles to be added to the dialog.
ParametricProfileItems: The parametric profiles to be added to the dialog.
Profile: The profile that will be selected in the tree.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.OnLoad(System.EventArgs)
When the load event is raised, the enumeration through the catalogs begins.
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.SelectedProfile
The selected profile.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.UseImperialUnits
Units used

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.SetUpImagesInTree
Sets the images that will be used in the tree view.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.FillTreeWithProfilesWithTreeStructure
Enumerate through the catalogs and fill the tree control.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.FillTreeWithProfiles
Enumerate through the catalogs and fill the tree control.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.CreateNewNode(System.String,System.String)
Creates a new node for profile names if needed (HEA for HEA300).

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.AddProfileToTree(Tekla.Structures.Catalogs.LibraryProfileItem,System.String)
Adds a library profile to the tree.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.AddProfileToTree(Tekla.Structures.Catalogs.ParametricProfileItem)
Adds a parametric profile to the tree.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.GetListOfParameters(System.String)
Gets the parameters from the ParameterString.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.CreateProfileTypeNode(Tekla.Structures.Catalogs.ProfileItem.ProfileItemTypeEnum)
Creates a profile type node if needed (e.g. I profile).

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.CancelClicked(System.Object,System.EventArgs)
If cancel is clicked no profile is passed.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.OkClicked(System.Object,System.EventArgs)
Closes the dialog.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.GetProfileStringInCurrentUnits(System.String)
Selects parametric profile item and converts values in profile string into used UI units.
Returns library profile item back without any changes.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.tree_AfterSelect(System.Object,System.Windows.Forms.TreeViewEventArgs)
Handles event if a value is selected in the tree view control.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.ProfileSelectionForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.